# Diffrent ways of creating Dataframes
***

In [69]:
import pandas as pd

Reading through a .csv file:

In [70]:
df = pd.read_csv("Doomsday survival rate.csv", sep = None, engine = "python")
df

,﻿Name,Date,Survival Rate,Number of People,Temperature,Bitcoin,Emotion Rate
0,Ankara,1.01.2021,0.5,150000,15,45000,50
1,London,1.02.2021,0.4,250000,25,85000,not given
2,New York,1.03.2021,0.3,15000000,30,90000,35
3,Paris,1.04.2021,0.2,5400000,10,20000,error values
4,Tokyo,1.05.2021,0.1,99000000,55,60000,98
5,Moscow,1.06.2021,0.0,34000,-20,150000,0

Reading through a excel file:

Second parameter is the name of the sheet.

In [71]:
df2 = pd.read_excel("Pandas notebook.xlsx", "Sayfa1")
df2

       Name       Date  Survival Rate  Number of People
0    Ankara 2021-01-01            0.5            150000
1    London 2021-02-01            0.4            250000
2  New York 2021-03-01            0.3          15000000
3     Paris 2021-04-01            0.2           5400000
4     Tokyo 2021-05-01            0.1          99000000
5    Moscow 2021-06-01            0.0             34000

Reading through a dictionary:

In [72]:
survivalRate = {
    'City Name' : ["Ankara", "London", "New York", "Paris", "Tokyo", "Moscow"],
    'Date' : ['1.01.2021', '2.01.2021', '3.01.2021', '4.01.2021', '5.01.2021', '6.01.2021'],
    'Survival Rate' : [0.5, 0.4, 0.3, 0.2, 0.1, 0.0],
    'Number of People' : [150000, 250000, 15000000, 540000, 99000000, 34000],
    'Temperature' : [15, 25, 30, 10, 55, -20]
}

df3 = pd.DataFrame(survivalRate)
df3

  City Name       Date  Survival Rate  Number of People  Temperature
0    Ankara  1.01.2021            0.5            150000           15
1    London  2.01.2021            0.4            250000           25
2  New York  3.01.2021            0.3          15000000           30
3     Paris  4.01.2021            0.2            540000           10
4     Tokyo  5.01.2021            0.1          99000000           55
5    Moscow  6.01.2021            0.0             34000          -20

Reading through a list of Tuples:

In [73]:
survivalRate2 = [
    ('Ankara', '1.01.2021', 0.5, 150000, 15),
    ('London', '2.01.2021', 0.4,250000, 25),
    ('New York', '3.01.2021', 0.3, 15000000, 30)
]

df4 = pd.DataFrame(survivalRate2, columns = ["City Name", "Date", "Survival Rate", "Number of People", "Temperature"])
df4

  City Name       Date  Survival Rate  Number of People  Temperature
0    Ankara  1.01.2021            0.5            150000           15
1    London  2.01.2021            0.4            250000           25
2  New York  3.01.2021            0.3          15000000           30

Reading through a list of dictionaries:

In [74]:
survivalRate3 = [
    {'City Name' : "Ankara", "Date" : "1.01.2021", "Survival Rate" : 0.5, "Number of People" : 150000, "Temperature" : 15},
    {'City Name' : "London", "Date" : "2.01.2021", "Survival Rate" : 0.4, "Number of People" : 250000, "Temperature" : 25},
    {'City Name' : "New York", "Date" : "3.01.2021", "Survival Rate" : 0.3, "Number of People" : 15000000, "Temperature" : 30},
]

df5 = pd.DataFrame(survivalRate3)
df5

  City Name       Date  Survival Rate  Number of People  Temperature
0    Ankara  1.01.2021            0.5            150000           15
1    London  2.01.2021            0.4            250000           25
2  New York  3.01.2021            0.3          15000000           30

## To see other ways of reading check this url: https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

***
# Read - Write CSV Files

In [75]:
dataFrame = pd.read_csv("Doomsday survival rate.csv", nrows = 4, na_values =["error values", "not given"] ,sep = None, engine = "python")
dataFrame

,﻿Name,Date,Survival Rate,Number of People,Temperature,Bitcoin,Emotion Rate
0,Ankara,1.01.2021,0.5,150000,15,45000,50.0
1,London,1.02.2021,0.4,250000,25,85000,NaN
2,New York,1.03.2021,0.3,15000000,30,90000,35.0
3,Paris,1.04.2021,0.2,5400000,10,20000,NaN

Supplying direct list values to `na_values` function may cause some problems.
<br>For example there are some values in a column that cannot be there, but that value may be suitable for another column.
<br>So instead of giving a direct list, we can use dictioneries:

In [76]:
dataFrame = pd.read_csv("Doomsday survival rate.csv", nrows = 4, na_values ={
    'Emotion Rate' : ["error values", "not given"],
    'Survial Rate' : [-1],
    'Temperature'  : [-273]
    } ,sep = None, engine = "python")
dataFrame

,﻿Name,Date,Survival Rate,Number of People,Temperature,Bitcoin,Emotion Rate
0,Ankara,1.01.2021,0.5,150000,15,45000,50.0
1,London,1.02.2021,0.4,250000,25,85000,NaN
2,New York,1.03.2021,0.3,15000000,30,90000,35.0
3,Paris,1.04.2021,0.2,5400000,10,20000,NaN

## Writing to CSV

In [77]:
dataFrame.to_csv('new.csv', index = False)

## Writing to EXCEL

In [78]:
dataFrame.to_excel("new.xlsx", sheet_name = "doomed ones", index = False)

Now lets say you have two diffrent data frames and you want to write them into the same .xlsx file but in diffrent sheets.
<br>The way of doing that is, using a class called `ExcelWriter`:

In [79]:
with pd.ExcelWriter("NewWrited.xlsx") as writer:
    dataFrame.to_excel(writer, sheet_name = "Sheet - 1")
    df5.to_excel(writer, sheet_name = "Sheet -2")

## All of the properties of the reading and writing can be accessed through documentation: https://pandas.pydata.org/docs/reference/io.html

# End of the section
***